# Proposal

## Use Case

#### Big Question
- Which shippers are most/least reliable (arrival time delta between estimated and actual)?

#### Sub Questions
- Which are the most reliable shippers per country/region/subregion
- Which carrier companies are the most reliable?
- What, if any, were the reliability changes over the years?
    - How did covid affect reliability metrics of shipment times?
- Which consignees chose their shippers wisest?

# ETL Pipeline

In [1]:
import pandas as pd

from lib.utils import get_id_nums, clean_row, remove_incorrect_codes, data_fetch_url, data_send_url

## Countries

- Get table of countries with alpha-2 code that includes region from repository
    - https://github.com/lukes/ISO-3166-Countries-with-Regional-Codes

In [28]:
countries_cols = ['name', 'alpha-2', 'region', 'sub-region']
# keep_default_na=False because Namibia's code is NA
countries = pd.read_csv(data_send_url('bronze', 'country_data'), usecols=countries_cols, keep_default_na=False)

extra_codes = pd.DataFrame(
    {'name': ['Czechia', 'Netherland Antilles', 'Germany', 'European Union'], 
    'alpha-2': ['XC', 'AN', 'DD', 'EU'], 
    'region': ['Europe', 'Americas', 'Europe', 'Europe'], 
    'sub-region': ['Eastern Europe', 'Latin America and the Caribbean', 'Western Europe', 'Western Europe']}
    )

extra_codes
countries = pd.concat([countries, extra_codes], ignore_index=True, keys=['alpha-2', 'name'])

# Change countries index column to be alpha-2 values and rename to id
countries.set_index('alpha-2', inplace=True)
countries.index.name = 'id'
countries.sort_index(inplace=True)

# Create country code set with O(1) lookup for table cleaning
alpha_2_set = set(countries.index)

# Create country name dictionary with O(1) lookup for table cleaning
country_dict = {x[1].upper(): x[0] for x in countries.itertuples()}

# Add some statistically siginificant outliers, including common 2 common 'typos'
country_dict['TAIWAN'] = 'TW'
country_dict['SOUTH KOREA'] = 'KR'
country_dict['SHANGHAI CN'] = 'CN'
country_dict['SHANGHAI'] = 'CN'
country_dict['SHANGHAI .'] = 'CN'
country_dict['HONG KONG .'] = 'CN'
country_dict['TAIPEI .'] = 'TW'
country_dict['USA'] = 'US'
country_dict['U.S.A.'] = 'US'

## Shipper

- Read CSVs to DataFrames with only necessary columns

In [8]:
shipper_0 = pd.read_csv(data_fetch_url('bronze', 'shipper', '18', '0'))
shipper_1 = pd.read_csv(data_fetch_url('bronze', 'shipper', '18', '1'))
shipper_2 = pd.read_csv(data_fetch_url('bronze', 'shipper', '19', '0'))
shipper_3 = pd.read_csv(data_fetch_url('bronze', 'shipper', '19', '1'))
shipper_4 = pd.read_csv(data_fetch_url('bronze', 'shipper', '20', '0'))
shipper_5 = pd.read_csv(data_fetch_url('bronze', 'shipper', '20', '1'))

- Concatenate shippers DataFrames to single DataFrame

In [9]:
shippers = pd.concat([shipper_0, shipper_1, shipper_2, shipper_3, shipper_4, shipper_5], ignore_index=True)

In [8]:
# Replace NaN in name with Unknown
shippers['shipper_party_name'].fillna('N/A', inplace=True)

- Clean shipper rows and remove remaining unnecessary columns - (see utils.py for **CLEAN_ROW** function)

In [9]:
shipper_clean = shippers.apply(lambda row: clean_row(row, 'shipper_party', alpha_2_set, country_dict), axis=1)

- **Result:** out of 40,240,366 values


|  | Before Cleaning | After Cleaning |
| - | - | - |
| country_codes #| 9,911,774 | 13,100,153| 
| country_codes %| 24.6% | 32.55% |

- Create shipper id column and map IDs by name - (see utils.py for **GET_ID_NUMS** function)

In [13]:
shipper_id_dict = get_id_nums(shipper_clean['shipper_party_name'])
shipper_clean['shipper_id'] = shipper_clean['shipper_party_name'].map(shipper_id_dict)

- Write cleaned data to CSV (time consuming process -- no mistakes)

In [ ]:
shipper_fail_safe_path = data_send_url('fail_safe', 'shipper_clean')
shipper_clean.to_csv(shipper_fail_safe_path, mode='w')

## Consignee

- copy CSVs to DataFrames

In [27]:
consignee_0 = pd.read_csv(data_fetch_url('bronze', 'consignee', '18', '0'))
consignee_1 = pd.read_csv(data_fetch_url('bronze', 'consignee', '18', '1'))
consignee_2 = pd.read_csv(data_fetch_url('bronze', 'consignee', '19', '0'))
consignee_3 = pd.read_csv(data_fetch_url('bronze', 'consignee', '19', '1'))
consignee_4 = pd.read_csv(data_fetch_url('bronze', 'consignee', '20', '0'))
consignee_5 = pd.read_csv(data_fetch_url('bronze', 'consignee', '20', '1'))

- Concatenate to single DataFrame

In [29]:
consignees = pd.concat([consignee_0, consignee_1, consignee_2, consignee_3, consignee_4, consignee_5], ignore_index=True)

- Fill NaN names with N/A

In [9]:
consignees['consignee_name'].fillna('N/A', inplace=True)

- Clean names and country codes, remove unneceessary columns

In [ ]:
consignee_clean = consignees.apply(lambda row: clean_row(row, 'consignee', alpha_2_set, country_dict), axis=1)

- Map IDs to consignees by name

In [37]:
consignee_id_dict = get_id_nums(consignee_clean['consignee_name'])
consignee_clean['consignee_id'] = consignee_clean['consignee_name'].map(consignee_id_dict)

- Save expensive task to CSV in case of errors

In [38]:
consignee_fail_safe_path = data_send_url('fail_safe', 'consignee_clean')
consignee_clean.to_csv(consignee_fail_safe_path, mode='w')

## Header

- Read header CSV files

In [ ]:
header_0 = pd.read_csv(data_fetch_url('bronze', 'header', '18', '0'))
header_1 = pd.read_csv(data_fetch_url('bronze', 'header', '18', '1'))
header_2 = pd.read_csv(data_fetch_url('bronze', 'header', '18', '2'))
header_3 = pd.read_csv(data_fetch_url('bronze', 'header', '18', '3'))
header_4 = pd.read_csv(data_fetch_url('bronze', 'header', '19', '0'))
header_5 = pd.read_csv(data_fetch_url('bronze', 'header', '19', '1'))
header_6 = pd.read_csv(data_fetch_url('bronze', 'header', '19', '2'))
header_7 = pd.read_csv(data_fetch_url('bronze', 'header', '19', '3'))
header_8 = pd.read_csv(data_fetch_url('bronze', 'header', '20', '0'))
header_9 = pd.read_csv(data_fetch_url('bronze', 'header', '20', '1'))
header_10 = pd.read_csv(data_fetch_url('bronze', 'header', '20', '2'))

- Concat to a single DataFrame

In [3]:
headers = pd.concat([header_0, header_1, header_2, header_3, header_4, header_5, header_6, header_7, header_8, header_9, header_10], ignore_index=True)

### Vessel Table

- Separate out vessel table

In [5]:
vessel_silver_cols = ['vessel_name', 'vessel_country_code', 'carrier_code', 'conveyance_id_qualifier', 'conveyance_id']
vessels = headers[['identifier'] + vessel_silver_cols]
vessels.loc[:, 'vessel_name'] = vessels['vessel_name'].fillna('N/A')
vessels.loc[:, 'vessel_country_code'] = vessels['vessel_country_code'].fillna('N/A')

- Get unique vessels from name + country and assign ids

In [ ]:
vessels['temp'] = vessels['vessel_name'] + ' ' + vessels['vessel_country_code']
vessel_id_dict = get_id_nums(vessels['temp'])
vessels['vessel_id'] = vessels['temp'].map(vessel_id_dict)

- Merge with header on identifier to assign vessel_id as foreign key

In [7]:
headers = headers.merge(vessels[['identifier', 'vessel_id']], on=['identifier'], how='inner')

- Remove repeat vessels, drop identifier and temp column, set index as id

In [22]:
vessels.drop_duplicates(subset=['temp'], inplace=True)
vessels.drop(labels=['identifier', 'temp'], axis=1, inplace=True)
vessels.set_index(keys='vessel_id', inplace=True)

- Remove erroneous or unknown country codes

In [30]:
vessels['vessel_country_code'] = vessels['vessel_country_code'].apply(lambda row: remove_incorrect_codes(row, alpha_2_set))

- Remove vessel columns and columns with non-nulls <= 10%

In [9]:
notify = 'secondary_notify_party_'
insig_cols = [
        'port_of_destination', 
        'foreign_port_of_destination', 
        'foreign_port_of_destination_qualifier', 
        'in_bond_entry_type', 
        notify + '2', notify + '3', notify + '4', notify + '5', 
        notify + '6', notify + '7', notify + '8', notify + '9', notify + '10'
    ]

headers.drop(vessel_silver_cols + insig_cols, inplace=True, axis=1)

## Junction Tables

In [42]:
identifier_rename = {'identifier': 'shipment_id'}

### Shipper_Shipment

In [36]:
shipper_shipment = shipper_clean[['identifier', 'shipper_id']].copy()
shipper_shipment.index.name = 'shipper_shipment_id'
shipper_shipment.rename(columns=identifier_rename, inplace=True)

### Consignee_Shipment

In [43]:
consignee_shipment = consignee_clean[['identifier', 'consignee_id']].copy()
consignee_shipment.index.name = 'cosignee_shipment_id'
consignee_shipment.rename(columns=identifier_rename, inplace=True)

## Silver Layer Creation

![](/Users/jesseputnam/cs-learning/skillstorm/project01/silver_erd.png)

- Remove identifier from consignee and shipper, drop duplicates on id, change index to IDs

In [63]:
shipper_clean.drop(['identifier'], axis=1, inplace=True)
shipper_clean.drop_duplicates(subset=['shipper_id'], inplace=True)
shipper_clean.set_index(['shipper_id'], inplace=True)

In [71]:
consignee_clean.drop(['identifier'], axis=1, inplace=True)
consignee_clean.drop_duplicates(subset=['consignee_id'], inplace=True)
consignee_clean.set_index(['consignee_id'], inplace=True)

- Change index on header to identifier

In [ ]:
headers.set_index(['identifier'], inplace=True)
headers.index.name = 'shipment_id'

- Upload shipper, shipment, shipper_shipment, consignee_shipment, consignee as as csv for SQL batch loading

In [34]:
headers.to_csv(data_send_url('silver', 'shipment'), mode='w')
vessels.to_csv(data_send_url('silver', 'vessel'), mode='w')
shipper_clean.to_csv(data_send_url('silver', 'shipper'), mode='w')
consignee_clean.to_csv(data_send_url('silver', 'consignee'), mode='w')
shipper_shipment.to_csv(data_send_url('silver', 'shipper_shipment'), mode='w')
consignee_shipment.to_csv(data_send_url('silver', 'consignee_shipment'), mode='w')
countries.to_csv(data_send_url('silver', 'country'), mode='w')

## Gold Layer Creation

![ERD](/Users/jesseputnam/cs-learning/skillstorm/project01/erd.png)

- Prep tables for Gold layer

In [ ]:
shipper_clean.rename(columns={"shipper_party_name": "shipper_name"}, inplace=True)

In [16]:
# Choose columns to keep
shipper_cols = ['shipper_party_name', 'country_code']
consignee_cols = ['consignee_name', 'country_code']
header_cols = ['vessel_id', 'estimated_arrival_date','actual_arrival_date']
vessel_cols = ['vessel_name', 'vessel_country_code', 'carrier_code']

- Upload 'denormalized' gold layer tables to folder for virtual mount

In [19]:
countries.to_csv(data_send_url('gold', 'country'), mode='w')
vessels[vessel_cols].to_csv(data_send_url('gold', 'vessel'), mode='w')
headers[header_cols].to_csv(data_send_url('gold', 'shipment'), mode='w')
shipper_clean[shipper_cols].to_csv(data_send_url('gold', 'shipper'), mode='w')
consignee_clean[consignee_cols].to_csv(data_send_url('gold', 'consignee'), mode='w')
shipper_shipment.to_csv(data_send_url('gold', 'shipper_shipment'), mode='w')
consignee_shipment.to_csv(data_send_url('gold', 'consignee_shipment'), mode='w')

### Late Emendation

- After everything, and only during SQL querying, I noticed an overlooked error -- dates outside the range of 2017-2020 which caused arrival deltas of between 300 and 3000 days.
- Late into the project, with time not on my side, I decided to fix it at the gold layer - as crunching the data from the silver layer would take too much time
- If I had more time, I would have added this cleaning step to the silver layer

- My fix was to drop all dates outside the specified years

In [17]:
sh_fix = pd.read_csv(data_send_url('gold', 'shipment'), parse_dates=['estimated_arrival_date', 'actual_arrival_date'], index_col=[0])

In [19]:
sh_fixed = sh_fix[(sh_fix['estimated_arrival_date'].dt.year.isin([2018, 2019, 2020])) & (sh_fix['actual_arrival_date'].dt.year.isin([2018, 2019, 2020]))]

In [21]:
sh_fixed.to_csv(data_send_url('gold', 'shipment'))

### SQL Database

In [2]:
import pyodbc
import os

In [3]:
server = os.getenv('SERVER')
username = os.getenv('USER')
password = os.getenv('PASSWORD')
driver = os.getenv('DRIVER')

#### SQL Table Creation

In [5]:
create_tables_file = '/Users/jesseputnam/cs-learning/skillstorm/project01/sql/create_db_tables.sql'

try: 
    conn = pyodbc.connect(driver=driver, server=server, uid=username, pwd=password, autocommit=True)
    cursor = conn.cursor()
    print("Connected Successfully!\n")
    
    with open(create_tables_file, 'r') as f:
        sql_statements = f.read().replace('\n', '').strip().split(";")
        sql_statements = [x + ';' for x in sql_statements if x]

        for statement in sql_statements:
            cursor.execute(statement)

            split = statement.split('    ')
            if split[0].split()[0] == 'USE':
                cmd_run = split[0].split()[0]
            else:
                cmd_run = f"{split[1].split()[0]} {split[1].split()[1]}"

            print(f"{cmd_run} statement executed")

except pyodbc.Error as e:
    print(f"Error: {e}")
finally:
    if conn:
        conn.close()
        print('Connection closed\n')
    else:
        print('No connection was established')

Connected Successfully!

USE statement executed
CREATE DATABASE statement executed
USE statement executed
CREATE TABLE statement executed
CREATE TABLE statement executed
CREATE TABLE statement executed
CREATE TABLE statement executed
CREATE TABLE statement executed
CREATE TABLE statement executed
CREATE TABLE statement executed
Connection closed

#### Bulk Insert from Gold Layer

In [6]:
bulk_load_file = '/Users/jesseputnam/cs-learning/skillstorm/project01/sql/load_db_tables.sql'

try: 
    conn = pyodbc.connect(driver=driver, server=server, uid=username, pwd=password, autocommit=True)
    cursor = conn.cursor()
    print("Connected Successfully!\n")

    with open(bulk_load_file, 'r') as f:
        sql_statements = f.read().replace('\n', '').split(";")
        sql_statements = [x for x in sql_statements if x]

        for statement in sql_statements:
            cursor.execute(statement)
            words = statement.split()
            print(f"{words[0]} {words[1]} {words[2] if len(words) > 2 else ''} statement executed")

except pyodbc.Error as e:
    print(f"Error: {e}")
finally:
    if conn:
        conn.close()
        print('\nConnection closed')
    else:
        print('\nNo connection was established')

Connected Successfully!

USE ams  statement executed
BULK INSERT dbo.country statement executed
BULK INSERT dbo.vessel statement executed
BULK INSERT dbo.shipment statement executed
BULK INSERT dbo.shipper statement executed
BULK INSERT dbo.consignee statement executed
BULK INSERT dbo.shipper_shipment statement executed
BULK INSERT dbo.consignee_shipment statement executed

Connection closed

# Analysis

### SQL Queries

In [37]:
# SELECT statements vars
avg_delta = 'AVG(t.delta) AS avg_delta'
total_shipments = 'COUNT(t.delta) AS total_shipments'
delta = 'CAST(DATEDIFF(day, sh.estimated_arrival_date, sh.actual_arrival_date) AS FLOAT) AS delta'

# JOIN statement vars
shipper_shipment_to_shipment = 'shipper_shipment ss ON sh.shipment_id = ss.shipment_id'
shipper_to_shipper_shipment = 'shipper s ON ss.shipper_id = s.shipper_id'
country_to_shipper = 'country c ON s.shipper_country_code = c.country_id'
vessel_to_shipment = 'vessel v ON sh.vessel_id = v.vessel_id'

# WHERE statement vars
years_equal = '(YEAR(sh.actual_arrival_date) = YEAR(sh.estimated_arrival_date))'
delta_in_variance = 'ABS(DATEDIFF(day, sh.estimated_arrival_date, sh.actual_arrival_date)) < 60'
min_shipments_met = 'delta_t.total_shipments > 100'


statement_1 = f'''
SELECT TOP 15 * FROM 
(
    SELECT t.shipper_name, {avg_delta}, {total_shipments}
    FROM 
        (
            SELECT s.shipper_name, {delta}
            FROM shipment sh
            JOIN {shipper_shipment_to_shipment}
            JOIN {shipper_to_shipper_shipment}
            WHERE {years_equal} AND {delta_in_variance}
        ) AS t
    GROUP BY t.shipper_name
) AS delta_t
WHERE {min_shipments_met}
ORDER BY delta_t.avg_delta ASC
'''

statement_2 = f'''
SELECT TOP 15 * FROM 
(
    SELECT t.shipper_name, {avg_delta}, {total_shipments}
    FROM 
        (
            SELECT s.shipper_name, {delta}
            FROM shipment sh
            JOIN {shipper_shipment_to_shipment}
            JOIN {shipper_to_shipper_shipment}
            WHERE {years_equal} AND {delta_in_variance}
        ) AS t
    GROUP BY t.shipper_name
) AS delta_t
WHERE {min_shipments_met}
ORDER BY delta_t.avg_delta DESC
'''

statement_3 = f'''
SELECT TOP 15 * FROM 
(
    SELECT t.country_name, {avg_delta}, {total_shipments}
    FROM 
        (
            SELECT c.country_name, {delta}
            FROM shipment sh
            JOIN {shipper_shipment_to_shipment}
            JOIN {shipper_to_shipper_shipment}
            JOIN {country_to_shipper}
            WHERE s.shipper_country_code IS NOT NULL AND {years_equal} AND {delta_in_variance}
        ) AS t
    GROUP BY t.country_name
) AS delta_t
WHERE {min_shipments_met}
ORDER BY delta_t.avg_delta ASC
'''

statement_4 = f'''
SELECT TOP 15 * FROM 
(
    SELECT t.country_name, {avg_delta}, {total_shipments}
    FROM 
        (
            SELECT c.country_name, {delta}
            FROM shipment sh
            JOIN {shipper_shipment_to_shipment}
            JOIN {shipper_to_shipper_shipment}
            JOIN {country_to_shipper}
            WHERE s.shipper_country_code IS NOT NULL AND {years_equal} AND {delta_in_variance}
        ) AS t
    GROUP BY t.country_name
) AS delta_t
WHERE {min_shipments_met}
ORDER BY delta_t.avg_delta DESC
'''

statement_5 = f'''
SELECT * FROM 
(
    SELECT t.region, {avg_delta}, {total_shipments}
    FROM 
        (
            SELECT c.region, {delta}
            FROM shipment sh
            JOIN {shipper_shipment_to_shipment}
            JOIN {shipper_to_shipper_shipment}
            JOIN {country_to_shipper}
            WHERE 
                s.shipper_country_code IS NOT NULL
                AND c.region IS NOT NULL
                AND {years_equal} 
                AND {delta_in_variance}
        ) AS t
    GROUP BY t.region
) AS delta_t
WHERE {min_shipments_met}
ORDER BY delta_t.avg_delta ASC
'''

statement_6 = f'''
SELECT * FROM 
(
    SELECT t.sub_region, {avg_delta}, {total_shipments}
    FROM 
        (
            SELECT c.sub_region, {delta}
            FROM shipment sh
            JOIN {shipper_shipment_to_shipment}
            JOIN {shipper_to_shipper_shipment}
            JOIN {country_to_shipper}
            WHERE 
                s.shipper_country_code IS NOT NULL
                AND c.sub_region IS NOT NULL
                AND {years_equal} 
                AND {delta_in_variance}
        ) AS t
    GROUP BY t.sub_region
) AS delta_t
WHERE {min_shipments_met}
ORDER BY delta_t.avg_delta ASC
'''

statement_7 = f'''
SELECT TOP 15 * FROM 
(
    SELECT t.vessel_id, t.vessel_name, {avg_delta}, {total_shipments}
    FROM 
        (
            SELECT v.vessel_id, v.vessel_name, {delta}
            FROM shipment sh
            JOIN {vessel_to_shipment}
            WHERE {years_equal} AND {delta_in_variance}
        ) AS t
    GROUP BY t.vessel_id, t.vessel_name
) AS delta_t
WHERE {min_shipments_met}
ORDER BY delta_t.avg_delta ASC
'''

statement_8 = f'''
SELECT TOP 15 * FROM 
(
    SELECT t.vessel_id, t.vessel_name, {avg_delta}, {total_shipments}
    FROM 
        (
            SELECT v.vessel_id, v.vessel_name, {delta}
            FROM shipment sh
            JOIN {vessel_to_shipment}
            WHERE {years_equal} AND {delta_in_variance}
        ) AS t
    GROUP BY t.vessel_id, t.vessel_name
) AS delta_t
WHERE {min_shipments_met}
ORDER BY delta_t.avg_delta DESC
'''

statement_9 = f'''
SELECT * FROM 
(
    SELECT t.year, {avg_delta}, {total_shipments}s
    FROM 
        (
            SELECT YEAR(sh.actual_arrival_date) AS year, {delta}
            FROM shipment sh
            WHERE {years_equal} AND {delta_in_variance}
        ) AS t
    GROUP BY t.year
) AS delta_t
WHERE {min_shipments_met}
ORDER BY delta_t.year ASC
'''

statement_10 = f'''
SELECT TOP 15 * FROM 
(
    SELECT t.consignee_name, {avg_delta}, {total_shipments}
    FROM 
        (
            SELECT c.consignee_name, {delta}
            FROM shipment sh
            JOIN consignee_shipment cs ON cs.shipment_id = sh.shipment_id
            JOIN consignee c ON c.consignee_id = cs.consignee_id
            WHERE 
                {years_equal} AND {delta_in_variance}
        ) AS t
    GROUP BY t.consignee_name
) AS delta_t
WHERE {min_shipments_met}
ORDER BY delta_t.avg_delta ASC
'''

### SQL Execution

In [33]:
try: 
    conn = pyodbc.connect(driver=driver, server=server, uid=username, pwd=password, database='ams', autocommit=True)
    cursor = conn.cursor()
    print("Connected Successfully!\n")

    top_shippers = pd.read_sql(statement_1, conn)
    bottom_shippers = pd.read_sql(statement_2, conn)
    top_countries = pd.read_sql(statement_3, conn)
    bottom_countries = pd.read_sql(statement_4, conn)
    regions_ranked = pd.read_sql(statement_5, conn)
    sub_regions_ranked = pd.read_sql(statement_6, conn)
    top_vessels = pd.read_sql(statement_7, conn)
    bottom_vessels = pd.read_sql(statement_8, conn)
    years = pd.read_sql(statement_9, conn)
    most_savvy_consignees = pd.read_sql(statement_10, conn)
    
except pyodbc.Error as e:
    print(f"Error: {e}")
finally:
    if conn:
        conn.close()
        print('\nConnection closed\n')
    else:
        print('\nNo connection was established\n')

Connected Successfully!

/var/folders/8b/3qtjthpj3qqf5dzr_n4g__mw0000gn/T/ipykernel_67010/2924014295.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  top_shippers = pd.read_sql(statement_1, conn)
/var/folders/8b/3qtjthpj3qqf5dzr_n4g__mw0000gn/T/ipykernel_67010/2924014295.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  top_countries = pd.read_sql(statement_3, conn)
/var/folders/8b/3qtjthpj3qqf5dzr_n4g__mw0000gn/T/ipykernel_67010/2924014295.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sub_regions_ranked = pd.read_sql(statement_6, conn)

Connection closed

- View 1: Shippers with the best estimated vs actual arrival times

In [34]:
top_shippers

                          shipper_name  avg_delta  total_shipments
0                       BOBCAT COMPANY -40.365248              846
1            MABE MEXICO S DE RL DE CV -27.034783              115
2            TREND TECHNOLOGIES MEXICO -26.789189              185
3         MARGARITA S LIMES S A DE C V -26.715909              176
4    TORAY ADVANCED TEXTILE MEXICO S A -25.740113              354
5         SOC EXP Y COM VINA MAIPO SPA -24.914729              129
6        GENERAL MOTORS DE MEXICO S DE -24.421769              147
7       JOHNSON CONTROLS BE OPERATIONS -24.072612             1267
8   HELLA AUTOMOTIVE MEXICO S A DE C V -23.876289              194
9   FLEXITECH AUTOMOTIVE MEXICO, S. DE -23.672414              174
10       CONTITECH MEXICANA S A DE C V -23.398268              462
11    SILGAN DISPENSING SYSTEMS MEXICO -23.357860              299
12          GD AFILIATES,S DE RL DE CV -23.152263              243
13            OXFORD FROZEN FOODS LTD. -23.048338              331
14              PROVEEDORA MEXICANA DE -22.974359              117

- View 2: Shippers with the worst estimated vs actual times

In [17]:
bottom_shippers

                          shipper_name  avg_delta  total_shipments
0                   R.M. INTERNATIONAL  31.349057              106
1              SUKRITI DESIGNS PVT LTD  31.256881              109
2              TRUMPF LASER- & SYSTEM-  30.346840             1851
3                  ASCA SHIPPING GROUP  30.000000              135
4         TRUMPF MASCH.AUSTR.GMBH&COKG  29.085603              771
5   ULTRAMAR AGENCIA MARITIMA LIMITADA  27.812500              192
6                 ENSCO 8502 C/O ENSCO  27.235294              119
7                    KLK INTERNATIONAL  26.211191              554
8                            MINUTY SA  26.110787              343
9                    ACS DOBFAR S.P.A.  25.094737              380
10         HORTON EUROPE GMBH & CO. KG  24.801724              116
11          PARIKH PACKAGING PVT. LTD.  23.395161              124
12                   TRUMPF SCHWEIZ AG  23.092732              399
13                         BHARTI ARTS  21.589862              217
14                    HASTKALA EXPORTS  20.942857              105

- View 3: Countries with the best estimated vs actual arrival times

In [35]:
top_countries

                         country_name  avg_delta  total_shipments
0                           Nicaragua  -0.367552             5572
1                               Chile  -0.345799            85891
2                              Mexico  -0.293571           154351
3                             Lesotho  -0.110803             1805
4            Turks and Caicos Islands   0.249402             1672
5                             Jamaica   0.397264             6872
6                         El Salvador   0.532831             5437
7   Congo, Democratic Republic of the   0.554795              146
8                  Dominican Republic   0.596171            26640
9                                Guam   0.676183             3783
10                             Gambia   0.686047              860
11                Antigua and Barbuda   0.691176              408
12                            Bahamas   0.707030            12305
13              Virgin Islands (U.S.)   0.738026             8623
14           Northern Mariana Islands   0.765517              145

- View 4: Countries with the worst estimated vs actual arrival times

In [19]:
bottom_countries

              country_name  avg_delta  total_shipments
0                 Suriname   9.380383              836
1                 Guernsey   6.174658              292
2     Moldova, Republic of   4.923077              117
3                     Iraq   4.914062              128
4               Kazakhstan   4.803371              178
5                  Algeria   4.252525              198
6   Bosnia and Herzegovina   4.215785             1191
7                  Albania   3.794964              278
8                    Qatar   3.704545              220
9                   Turkey   3.630559           135310
10                 Lebanon   3.251832             1092
11                 Bahrain   3.141892              592
12                   Italy   2.985387           717978
13                  Angola   2.983471              121
14               Mauritius   2.969058              711

- View 5: Regions ranked by estimated vs actual arrival times

In [20]:
regions_ranked

     region  avg_delta  total_shipments
0  Americas   0.924163           968831
1   Oceania   1.278483           174470
2      Asia   1.847987          7940698
3    Africa   1.874491            50817
4    Europe   2.284739          3299783

- View 6: Sub-regions ranked by estimated vs actual arrival times

In [36]:
sub_regions_ranked

                         sub_region  avg_delta  total_shipments
0   Latin America and the Caribbean   0.622827           708964
1                        Micronesia   0.807479             4680
2         Australia and New Zealand   1.264834           162687
3                         Melanesia   1.570497             3681
4                South-eastern Asia   1.620012           687703
5                Sub-Saharan Africa   1.665743            34291
6                      Eastern Asia   1.736373          6328502
7                  Northern America   1.746263           259867
8                    Eastern Europe   1.751605           224364
9                    Western Europe   1.972198          1555346
10                        Polynesia   2.257452             3422
11                  Northern Africa   2.307636            16526
12                  Northern Europe   2.385462           523263
13                    Southern Asia   2.656000           740325
14                  Southern Europe   2.839529           996810
15                     Western Asia   3.285137           183961
16                     Central Asia   4.560386              207

- View 7: Vessels with the best estimated vs actual arrival times

In [22]:
top_vessels

    vessel_id       vessel_name  avg_delta  total_shipments
0        4285         CHACABUCO -31.107981              213
1       10801     ZIM SAN DIEGO -30.300000              270
2       17541      CATTLEYA ACE -20.983553              304
3        1067           MALLECO -20.977612              134
4       25167               KEA -18.698182              825
5        3379            MEXICO -17.940701              371
6       36688   CSCL YELLOW SEA -15.841584              101
7       13106        APL NORWAY -15.344262              122
8       49441        MSC FLAVIA -13.767145              627
9       40880         APL PARIS -13.685185              108
10      20935  CMA CGM COLUMBIA -13.657364              645
11       8973    ANGELIC ZEPHYR -13.230769              104
12       5701        MSC FLAVIA -12.940480            20279
13      21335           MALLECO -12.111111              117
14      20812        SM TIANJIN -12.104317              278

- View 8: Vessels with the worst estimated vs actual arrival times

In [23]:
bottom_vessels

    vessel_id         vessel_name  avg_delta  total_shipments
0       21495        GRACE BRIDGE  55.086823              979
1       16417                PAXI  47.841584              101
2        3703         COSCO PRIDE  41.508876              169
3       44552      MEISHAN BRIDGE  41.090604              596
4       19216        JPO AQUARIUS  40.712281              285
5       41198      HELIOS HIGHWAY  30.000000              587
6       18975  CMA CGM J. MADISON  29.693431              137
7       14941          EVER ETHIC  28.922849              337
8       39498        HOEGH CARIBA  27.846890              209
9        8153          PRETTY IVY  27.776000              125
10      22386          EVER EXCEL  27.488372              172
11       7524          ENSCO 8502  27.118519              135
12      32521       MSC BENEDETTA  26.032258              155
13       9277         MSC TORONTO  24.839014             1379
14      19765        HOEGH JEDDAH  24.578431              204

- View 9: Years with average estimated vs actual arrival times

In [24]:
years

   year  avg_delta  total_shipments
0  2018   1.798971         19954784
1  2019   1.480462         18760914
2  2020   1.585411         14674282

- View 10: Consignees with the best estimated vs actual arrival times

In [25]:
most_savvy_consignees

                       consignee_name  avg_delta  total_shipments
0    JASON FURNITURE(HANGZHOU)CO.,LTD -40.438389              844
1                     OCEANROADS GMBH -29.454545              110
2                       VPA EXPORTERS -28.936782              174
3          AMA S.P.A. VIA PUCCINI, 28 -27.313636              440
4                    BUSYBEE KNITWEAR -26.687688              333
5               IGIFT COMPANY LIMITED -26.650794              126
6                  TALLER NAGUISA S L -25.901639              122
7                    SPENCER GOLDFARB -25.839901              406
8          YIWU WOQI PACKAGING CO LTD -25.740113              354
9              GIANT CASTLE CO., LTD. -25.051075              372
10       JIANGXI JINRUI HAIR PRODUCTS -25.048780              123
11    HAINING TEXTIMETEXTILE CO.,LTD. -24.745223              157
12       CH LIGHT TECHNOLOGY CO.,LTD. -24.595556              225
13  SHANGHAI JUFA AUTO PARTS CO., LTD -23.963636              110
14                     MEDICHEM, S.A. -23.962264              106